camaar/app/views/formularios/responder.html.erb

SELECT "questaos".* FROM "questaos" WHERE "questaos"."template_id" = ?  [["template_id", 1]]
---
<%= form_with model: @resultado, local: true do |f| %>
  <% @template.questaos.each do |questao| %>

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<%= form_with(model: @resultado, url: resultado_path(@resultado), method: :patch, local: true) do |f| %>
  <% @resultado.formulario.template.questaos.each do |questao| %>