camaar/app/views/resultados/edit.html.erb

        <%= form_for @resultado, local: true, method: :patch do |f| %>
            <% @template.questaos.each do |questao|%>
---
SELECT "questaos".* FROM "questaos" WHERE "questaos"."template_id" = ?  [["template_id", 1]]

                     <% else %>
                         <% questao.alternativas.each do |alternativa| %>
---
SELECT "alternativas".* FROM "alternativas" WHERE "alternativas"."questao_id" = ?  [["questao_id", 1]]