camaar/app/views/templates/_questao_fields.html.erb

        <%= f.label :tipo_id, "Tipo da Questão" %>
        <%= f.collection_select :tipo_id, Tipo.all, :id, :nome , class: 'seletor-tipo-questao'%>
---
SELECT "tipos".* FROM "tipos"