camaar/app/views/templates/edit.html.erb

                <div class='questaos-container'>
                    <% @template.questaos.each do |questao| %>
---
SELECT "questaos".* FROM "questaos" WHERE "questaos"."template_id" = ?  [["template_id", 1]]

                                    <%= questao_form.label :tipo_id, "Tipo da Questão" %>
                                    <%= questao_form.collection_select :tipo_id, Tipo.all, :id, :nome %>
---
SELECT "tipos".* FROM "tipos"

                                <div class='alternativas-container'>
                                    <% questao.alternativas.each do |alternativa| %>
---
SELECT "alternativas".* FROM "alternativas" WHERE "alternativas"."questao_id" = ?  [["questao_id", 1]]