camaar/app/views/templates/edit.html.erb

                                <div class='alternativas-container'>
                                    <% questao.alternativas.each do |alternativa| %>
---
SELECT "alternativas".* FROM "alternativas" WHERE "alternativas"."questao_id" = ?  [["questao_id", 1]]