camaar/app/views/templates/show.html.erb

SELECT "questaos".* FROM "questaos" WHERE "questaos"."template_id" = ?  [["template_id", 1]]
---
        <div class='questaos-container'>
            <% @template.questaos.each do |questao| %>

SELECT "alternativas".* FROM "alternativas" WHERE "alternativas"."questao_id" = ?  [["questao_id", 1]]
---
                        <ul>
                            <% questao.alternativas.each do |alternativa| %>