camaar/app/controllers/alternativas_controller.rb

SELECT "questaos".* FROM "questaos" WHERE "questaos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_questao
      @questao = Questao.find(params[:questao_id])

SELECT "alternativas".* FROM "alternativas" WHERE "alternativas"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_alternativa
      @alternativa = Alternativa.find(params[:id])