camaar/app/controllers/formularios_controller.rb

INSERT INTO "formularios" ("dataDeTermino", "nome", "respondentes", "docente_id", "template_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @formulario = Formulario.new(formulario_params)

    if @formulario.save

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_formulario
      @formulario = Formulario.find(params[:id])

SELECT "docentes".* FROM "docentes" WHERE "docentes"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
    def set_turmas_and_templates
      @docente = current_user.docente
      if @docente.present?

SELECT "questaos".* FROM "questaos" WHERE "questaos"."template_id" = ?  [["template_id", 2]]
SELECT "alternativas".* FROM "alternativas" WHERE "alternativas"."questao_id" = ?  [["questao_id", 4]]
INSERT INTO "resultados" ("formulario_id", "template_id", "questao_id", "alternativa_id", "respostas", "respostas_discursivas", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def criar_resultados_formulario(formulario)
      template = formulario.template
      template.questaos.each do |questao|
        questao.alternativas.each do |alternativa|
          Resultado.create!(
            formulario: formulario,
            template: template,
            questao: questao,
            alternativa: alternativa,
            quantidade_respostas: 0,
            respostas_discursivas: "aluno, "
          )