camaar/app/controllers/pages_controller.rb

SELECT "formularios".* FROM "formularios" INNER JOIN "formularios_turmas" ON "formularios"."id" = "formularios_turmas"."formulario_id" WHERE "formularios_turmas"."turma_id" = ?  [["turma_id", 1]]
---
  def home_dicente
    @dicente = Dicente.find_by(user_id: current_user.id)
    if @dicente.present?
      @turmas = TurmasDicente.where(dicente_id: @dicente.id).includes(turma: :formularios).map(&:turma)
      @turmas = [] unless @turmas.present?