camaar/app/controllers/pages_controller.rb

SELECT "dicentes".* FROM "dicentes" WHERE "dicentes"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "turmas_dicentes".* FROM "turmas_dicentes" WHERE "turmas_dicentes"."dicente_id" = ?  [["dicente_id", 1]]
SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = ?  [["id", 1]]
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = ?  [["id", 1]]
---
  def home_dicente
    @dicente = Dicente.find_by(user_id: current_user.id)
    if @dicente.present?
      @turmas = TurmasDicente.where(dicente_id: @dicente.id).includes(turma: :formularios).map(&:turma)
      if !@turmas.present?

SELECT "docentes".* FROM "docentes" WHERE "docentes"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "docentes".* FROM "docentes" WHERE "docentes"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "turmas".* FROM "turmas" WHERE "turmas"."docente_id" = ?  [["docente_id", 1]]
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "templates".* FROM "templates" WHERE "templates"."docente_id" = ?  [["docente_id", 1]]
---
  def home_docente
    @docente = Docente.find_by(user_id: current_user.id)
    if @docente.present?
      ##
      # Busca todas as classes do docente
      @turmas = Turma.where(docente_id: @docente.id)
      @turmas = [] unless @turmas.present?

      ##
      # Busca os templates
      @templates = Template.where(docente_id: @docente.id)