camaar/app/controllers/questaos_controller.rb

DELETE FROM "questaos" WHERE "questaos"."id" = ?  [["id", 1]]
---
  def destroy
    if @questao.destroy

SELECT "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def get_template
      @template = Template.find(params[:template_id])

SELECT "questaos".* FROM "questaos" WHERE "questaos"."template_id" = ? AND "questaos"."id" = ? LIMIT ?  [["template_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_questao
      @questao = @template.questaos.find(params[:id])