camaar/app/controllers/resultados_controller.rb

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @formulario = Formulario.find(params[:formulario_id])