camaar/app/controllers/resultados_controller.rb

SELECT "resultados".* FROM "resultados" WHERE "resultados"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_resultado
    @resultado = Resultado.find(params[:id])