camaar/app/controllers/resultados_controller.rb

  def update
    @formulario = @resultado.formulario
    @template = @formulario.template

    @template.questaos.each do |questao|
---
SELECT "questaos".* FROM "questaos" WHERE "questaos"."template_id" = ?  [["template_id", 1]]

  def set_resultado
    @resultado = Resultado.find(params[:id])
---
SELECT "resultados".* FROM "resultados" WHERE "resultados"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]