camaar/app/controllers/templates_controller.rb

SELECT "questaos".* FROM "questaos" WHERE "questaos"."template_id" = ?  [["template_id", 1]]
SELECT 1 AS one FROM "questaos" WHERE "questaos"."template_id" = ? LIMIT ?  [["template_id", 1], ["LIMIT", 1]]
SELECT "alternativas".* FROM "alternativas" WHERE "alternativas"."questao_id" = ?  [["questao_id", 1]]
SELECT 1 AS one FROM "alternativas" WHERE "alternativas"."questao_id" = ? LIMIT ?  [["questao_id", 1], ["LIMIT", 1]]
---
  def edit
    @template.questaos.build if @template.questaos.empty?
    @template.questaos.each do |questao|
      questao.alternativas.build if questao.alternativas.empty?

SELECT "docentes".* FROM "docentes" WHERE "docentes"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
INSERT INTO "templates" ("nome", "docente_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["nome", "teste de historia"], ["docente_id", 1], ["created_at", "2024-07-02 19:59:37.502739"], ["updated_at", "2024-07-02 19:59:37.502739"]]
---
  def create
    @template = Template.new(template_params)
    @template.docente = Docente.find_by(user_id: current_user.id)

    if @template.save