camaar/app/views/pages/home_dicente.html.erb

          <% if Date.today < formulario.dataDeTermino && !formulario.respondentes.include?(current_user.nome)%>
            <% resultado = formulario.resultados.find_by(formulario: formulario) %>
---
SELECT "resultados".* FROM "resultados" WHERE "resultados"."formulario_id" = ? AND "resultados"."formulario_id" = ? LIMIT ?  [["formulario_id", 1], ["formulario_id", 1], ["LIMIT", 1]]