camaar/app/views/pages/home_docente.html.erb

            <div class="templates-name"><%= template.nome.capitalize %></div>
            <% formulario = FormulariosTurma.find_by(formulario: Formulario.find_by(template: template)) %>
---
SELECT "formularios".* FROM "formularios" WHERE "formularios"."template_id" = ? LIMIT ?  [["template_id", 1], ["LIMIT", 1]]

            <div class="templates-name"><%= formulario.nome.capitalize %></div>
            <% formulario.turmas.each do |turma| %>
---
SELECT "turmas".* FROM "turmas" INNER JOIN "formularios_turmas" ON "turmas"."id" = "formularios_turmas"."turma_id" WHERE "formularios_turmas"."formulario_id" = ?  [["formulario_id", 1]]